In [2]:
# Load Matplotlib and data wrangling libraries.
import matplotlib.pyplot as plt
import numpy as np
import pandas as pd

# Load jobs dataset from Vega's dataset library.
from vega_datasets import data

# Let's use the jobs dataset for this since
# it has two dimensions we can compare across:
# job type and gender.
df = data.jobs()
df.head()

                    job  sex  year  count      perc
0  Accountant / Auditor  men  1850    708  0.000131
1  Accountant / Auditor  men  1860   1805  0.000214
2  Accountant / Auditor  men  1870   1310  0.000100
3  Accountant / Auditor  men  1880   2295  0.000125
4  Accountant / Auditor  men  1900  11753  0.000396

In [4]:
# Let's just look at the most recent data from 2000.
df = df.loc[df['year'] == 2000]

# Let's also just look at a sample of jobs since there
# are a bunch!
jobs = ['Actor', 'Bartender', 'Dentist', 'Engineer', 'Sailor', 'Scientist']
df = df.loc[df['job'].isin(jobs)]

# Note, the data is in "long" or "tidy" format, but wide can work too.
df.head()

            job    sex  year   count      perc
44        Actor    men  2000   29975  0.000178
59        Actor  women  2000   25931  0.000154
734   Bartender    men  2000  185678  0.001104
749   Bartender  women  2000  232073  0.001380
1844    Dentist    men  2000  141323  0.000841

In [5]:
df.loc[df['sex'] == 'men', 'count']

44       29975
734     185678
1844    141323
2234    396626
6164     31389
6254    116374
Name: count, dtype: int64